In [21]:
import pandas as pd
import numpy as np
from sklearn import datasets

In [23]:
articles_data = pd.read_csv('articles.csv')
bills_data = pd.read_csv('bills.csv')
hierarchy_data = pd.read_csv('hierarchy.csv')

In [40]:
#checking values
articles_data.head()

    id                                         name
0   89                           rin bar 150g rs.10
1  149  parle hide&seek chocolate chip cookies 120g
2  308                                  sabena 450g
3  375          britannia marie gold biscuits rs.22
4  404  britannia 50-50 maska chaska biscuits rs.10

In [41]:
bills_data.head()

   article_id   sale_date  unit_price  quantity  bill_no  total_price
0          89  2018-07-06      8.3000         1   526472       8.3000
1          89  2018-07-06      8.3040         5   526593      41.5200
2          89  2018-07-07      8.3057         7   526689      58.1399
3          89  2018-07-07      8.3000         1   526696       8.3000
4          89  2018-07-07      8.3067         6   526696      49.8402

In [42]:
hierarchy_data.head()

   article_id     category_name               subcategory_name brand_name
0          89        detergents                   washing bars        rin
1         149          biscuits                        cookies      parle
2         308  utensil cleaners               dishwash powders     sabena
3         375          biscuits  glucose marie & milk biscuits  britannia
4         404          biscuits                 salty biscuits  britannia